{
  "word2idx": {
    "<pad>": 0,
    "<unk>": 1,
    "<sos>": 2,
    "<eos>": 3,
    "they": 4,
    "practice": 5,
    "signs": 6,
    "we": 7,
    "need": 8,
    "sad": 9,
    "time": 10,
    "are": 11,
    "trying": 12,
    "money": 13,
    "i": 14,
    "work": 15,
    "food": 16,
    "he": 17,
    "come": 18,
    "new": 19,
    "question": 20,
    "like": 21,
    "important": 22,
    "you": 23,
    "will": 24,
    "want": 25,
    "do": 26,
    "not": 27,
    "write": 28,
    "phone": 29,
    "may": 30,
    "learn": 31,
    "cannot": 32,
    "know": 33,
    "water": 34,
    "understand": 35,
    "book": 36,
    "how": 37,
    "nice": 38,
    "is": 39,
    "it": 40,
    "writes": 41,
    "yesterday": 42,
    "to": 43,
    "teach": 44,
    "name": 45,
    "read": 46,
    "day": 47,
    "sign": 48,
    "pen": 49,
    "night": 50,
    "more": 51,
    "bad": 52,
    "idea": 53,
    "easy": 54,
    "chair": 55,
    "when": 56,
    "gos": 57,
    "evening": 58,
    "needs": 59,
    "go": 60,
    "big": 61,
    "can": 62,
    "likes": 63,
    "friday": 64,
    "afternoon": 65,
    "works": 66,
    "table": 67,
    "see": 68,
    "answer": 69,
    "reads": 70,
    "sunday": 71,
    "teachs": 72,
    "thursday": 73,
    "computer": 74,
    "think": 75,
    "difficult": 76,
    "today": 77,
    "problem": 78,
    "comes": 79,
    "good": 80,
    "what": 81,
    "the": 82,
    "am": 83,
    "practiceing": 84,
    "old": 85,
    "eat": 86,
    "at": 87,
    "office": 88,
    "learning": 89,
    "language": 90,
    "eating": 91,
    "where": 92,
    "try": 93,
    "finished": 94,
    "my": 95,
    "homework": 96,
    "wrong": 97,
    "trys": 98,
    "in": 99,
    "continue": 100,
    "tuesday": 101,
    "now": 102,
    "monday": 103,
    "due": 104,
    "finishing": 105,
    "runs": 106,
    "learns": 107,
    "morning": 108,
    "continueing": 109,
    "takeing": 110,
    "eats": 111,
    "continues": 112,
    "wants": 113,
    "why": 114,
    "tomorrow": 115,
    "does": 116,
    "home": 117,
    "improving": 118,
    "runing": 119,
    "run": 120,
    "take": 121,
    "class": 122,
    "practices": 123,
    "study": 124,
    "together": 125,
    "finish": 126,
    "please": 127,
    "look": 128,
    "history": 129,
    "school": 130,
    "doing": 131,
    "yes": 132,
    "watch": 133,
    "wait": 134,
    "sorry": 135,
    "raise": 136,
    "your": 137,
    "hand": 138,
    "back": 139,
    "seat": 140,
    "long": 141,
    "should": 142,
    "books": 143,
    "and": 144,
    "notes": 145,
    "live": 146,
    "city": 147,
    "speak": 148,
    "open": 149,
    "test": 150,
    "remember": 151,
    "takes": 152,
    "four": 153,
    "finishs": 154,
    "students": 155,
    "practicing": 156,
    "science": 157,
    "interesting": 158,
    "did": 159,
    "put": 160,
    "meet": 161,
    "on": 162,
    "who": 163,
    "this": 164,
    "she": 165,
    "writing": 166,
    "every": 167,
    "no": 168,
    "worries": 169,
    "friend": 170,
    "pleased": 171,
    "hello": 172,
    "everyone": 173,
    "help": 174,
    "each": 175,
    "other": 176,
    "repeat": 177,
    "that": 178,
    "sit": 179,
    "down": 180,
    "have": 181,
    "a": 182,
    "great": 183,
    "job": 184,
    "much": 185,
    "word": 186,
    "ready": 187,
    "studying": 188,
    "end": 189,
    "hard": 190,
    "daily": 191,
    "english": 192,
    "pay": 193,
    "attention": 194,
    "but": 195,
    "must": 196,
    "many": 197,
    "maybe": 198,
    "later": 199,
    "teacher": 200,
    "arrives": 201,
    "support": 202,
    "present": 203,
    "correct": 204,
    "teaches": 205,
    "well": 206,
    "helps": 207,
    "would": 208,
    "explain": 209,
    "ask": 210,
    "busy": 211,
    "worry": 212,
    "forgot": 213,
    "mean": 214,
    "okay": 215,
    "find": 216,
    "over": 217,
    "share": 218,
    "with": 219,
    "arrive": 220,
    "been": 221,
    "starts": 222,
    "working": 223,
    "appreciate": 224,
    "next": 225,
    "week": 226,
    "forget": 227,
    "text": 228,
    "partner": 229,
    "close": 230,
    "math": 231,
    "student": 232,
    "understands": 233,
    "grammar": 234,
    "rules": 235,
    "one": 236,
    "happy": 237,
    "groups": 238,
    "classroom": 239,
    "excellent": 240,
    "stands": 241,
    "keep": 242,
    "right": 243,
    "studied": 244,
    "bathroom": 245,
    "of": 246,
    "course": 247,
    "explaining": 248,
    "lesson": 249,
    "for": 250,
    "watching": 251,
    "video": 252,
    "guidance": 253,
    "reading": 254,
    "sure": 255,
    "listen": 256,
    "could": 257,
    "show": 258,
    "me": 259,
    "excuse": 260,
    "care": 261,
    "be": 262,
    "quiet": 263,
    "teaching": 264,
    "improve": 265,
    "month": 266,
    "favorite": 267,
    "subject": 268,
    "soon": 269,
    "start": 270,
    "concept": 271,
    "two": 272,
    "our": 273,
    "skills": 274,
    "very": 275,
    "us": 276,
    "give": 277,
    "hi": 278,
    "goodbye": 279,
    "bye": 280,
    "thank": 281,
    "thanks": 282,
    "so": 283,
    "welcome": 284,
    "fine": 285,
    "alright": 286,
    "agree": 287
  },
  "idx2word": {
    "0": "<pad>",
    "1": "<unk>",
    "2": "<sos>",
    "3": "<eos>",
    "4": "they",
    "5": "practice",
    "6": "signs",
    "7": "we",
    "8": "need",
    "9": "sad",
    "10": "time",
    "11": "are",
    "12": "trying",
    "13": "money",
    "14": "i",
    "15": "work",
    "16": "food",
    "17": "he",
    "18": "come",
    "19": "new",
    "20": "question",
    "21": "like",
    "22": "important",
    "23": "you",
    "24": "will",
    "25": "want",
    "26": "do",
    "27": "not",
    "28": "write",
    "29": "phone",
    "30": "may",
    "31": "learn",
    "32": "cannot",
    "33": "know",
    "34": "water",
    "35": "understand",
    "36": "book",
    "37": "how",
    "38": "nice",
    "39": "is",
    "40": "it",
    "41": "writes",
    "42": "yesterday",
    "43": "to",
    "44": "teach",
    "45": "name",
    "46": "read",
    "47": "day",
    "48": "sign",
    "49": "pen",
    "50": "night",
    "51": "more",
    "52": "bad",
    "53": "idea",
    "54": "easy",
    "55": "chair",
    "56": "when",
    "57": "gos",
    "58": "evening",
    "59": "needs",
    "60": "go",
    "61": "big",
    "62": "can",
    "63": "likes",
    "64": "friday",
    "65": "afternoon",
    "66": "works",
    "67": "table",
    "68": "see",
    "69": "answer",
    "70": "reads",
    "71": "sunday",
    "72": "teachs",
    "73": "thursday",
    "74": "computer",
    "75": "think",
    "76": "difficult",
    "77": "today",
    "78": "problem",
    "79": "comes",
    "80": "good",
    "81": "what",
    "82": "the",
    "83": "am",
    "84": "practiceing",
    "85": "old",
    "86": "eat",
    "87": "at",
    "88": "office",
    "89": "learning",
    "90": "language",
    "91": "eating",
    "92": "where",
    "93": "try",
    "94": "finished",
    "95": "my",
    "96": "homework",
    "97": "wrong",
    "98": "trys",
    "99": "in",
    "100": "continue",
    "101": "tuesday",
    "102": "now",
    "103": "monday",
    "104": "due",
    "105": "finishing",
    "106": "runs",
    "107": "learns",
    "108": "morning",
    "109": "continueing",
    "110": "takeing",
    "111": "eats",
    "112": "continues",
    "113": "wants",
    "114": "why",
    "115": "tomorrow",
    "116": "does",
    "117": "home",
    "118": "improving",
    "119": "runing",
    "120": "run",
    "121": "take",
    "122": "class",
    "123": "practices",
    "124": "study",
    "125": "together",
    "126": "finish",
    "127": "please",
    "128": "look",
    "129": "history",
    "130": "school",
    "131": "doing",
    "132": "yes",
    "133": "watch",
    "134": "wait",
    "135": "sorry",
    "136": "raise",
    "137": "your",
    "138": "hand",
    "139": "back",
    "140": "seat",
    "141": "long",
    "142": "should",
    "143": "books",
    "144": "and",
    "145": "notes",
    "146": "live",
    "147": "city",
    "148": "speak",
    "149": "open",
    "150": "test",
    "151": "remember",
    "152": "takes",
    "153": "four",
    "154": "finishs",
    "155": "students",
    "156": "practicing",
    "157": "science",
    "158": "interesting",
    "159": "did",
    "160": "put",
    "161": "meet",
    "162": "on",
    "163": "who",
    "164": "this",
    "165": "she",
    "166": "writing",
    "167": "every",
    "168": "no",
    "169": "worries",
    "170": "friend",
    "171": "pleased",
    "172": "hello",
    "173": "everyone",
    "174": "help",
    "175": "each",
    "176": "other",
    "177": "repeat",
    "178": "that",
    "179": "sit",
    "180": "down",
    "181": "have",
    "182": "a",
    "183": "great",
    "184": "job",
    "185": "much",
    "186": "word",
    "187": "ready",
    "188": "studying",
    "189": "end",
    "190": "hard",
    "191": "daily",
    "192": "english",
    "193": "pay",
    "194": "attention",
    "195": "but",
    "196": "must",
    "197": "many",
    "198": "maybe",
    "199": "later",
    "200": "teacher",
    "201": "arrives",
    "202": "support",
    "203": "present",
    "204": "correct",
    "205": "teaches",
    "206": "well",
    "207": "helps",
    "208": "would",
    "209": "explain",
    "210": "ask",
    "211": "busy",
    "212": "worry",
    "213": "forgot",
    "214": "mean",
    "215": "okay",
    "216": "find",
    "217": "over",
    "218": "share",
    "219": "with",
    "220": "arrive",
    "221": "been",
    "222": "starts",
    "223": "working",
    "224": "appreciate",
    "225": "next",
    "226": "week",
    "227": "forget",
    "228": "text",
    "229": "partner",
    "230": "close",
    "231": "math",
    "232": "student",
    "233": "understands",
    "234": "grammar",
    "235": "rules",
    "236": "one",
    "237": "happy",
    "238": "groups",
    "239": "classroom",
    "240": "excellent",
    "241": "stands",
    "242": "keep",
    "243": "right",
    "244": "studied",
    "245": "bathroom",
    "246": "of",
    "247": "course",
    "248": "explaining",
    "249": "lesson",
    "250": "for",
    "251": "watching",
    "252": "video",
    "253": "guidance",
    "254": "reading",
    "255": "sure",
    "256": "listen",
    "257": "could",
    "258": "show",
    "259": "me",
    "260": "excuse",
    "261": "care",
    "262": "be",
    "263": "quiet",
    "264": "teaching",
    "265": "improve",
    "266": "month",
    "267": "favorite",
    "268": "subject",
    "269": "soon",
    "270": "start",
    "271": "concept",
    "272": "two",
    "273": "our",
    "274": "skills",
    "275": "very",
    "276": "us",
    "277": "give",
    "278": "hi",
    "279": "goodbye",
    "280": "bye",
    "281": "thank",
    "282": "thanks",
    "283": "so",
    "284": "welcome",
    "285": "fine",
    "286": "alright",
    "287": "agree"
  }
}