{
  "word2idx": {
    "<pad>": 0,
    "<unk>": 1,
    "<sos>": 2,
    "<eos>": 3,
    "they": 4,
    "sign": 5,
    "practice": 6,
    "we": 7,
    "sad": 8,
    "time": 9,
    "need": 10,
    "money": 11,
    "try": 12,
    "i": 13,
    "food": 14,
    "work": 15,
    "he": 16,
    "new": 17,
    "question": 18,
    "come": 19,
    "important": 20,
    "like": 21,
    "you": 22,
    "want": 23,
    "will": 24,
    "phone": 25,
    "write": 26,
    "not": 27,
    "learn": 28,
    "may": 29,
    "know": 30,
    "can": 31,
    "water": 32,
    "book": 33,
    "understand": 34,
    "it": 35,
    "nice": 36,
    "how": 37,
    "yesterday": 38,
    "name": 39,
    "teach": 40,
    "read": 41,
    "day": 42,
    "pen": 43,
    "night": 44,
    "more": 45,
    "bad": 46,
    "idea": 47,
    "easy": 48,
    "chair": 49,
    "when": 50,
    "evening": 51,
    "go": 52,
    "big": 53,
    "friday": 54,
    "afternoon": 55,
    "table": 56,
    "see": 57,
    "answer": 58,
    "sunday": 59,
    "thursday": 60,
    "computer": 61,
    "think": 62,
    "difficult": 63,
    "today": 64,
    "problem": 65,
    "good": 66,
    "what": 67,
    "old": 68,
    "office": 69,
    "eat": 70,
    "language": 71,
    "where": 72,
    "homework": 73,
    "finish": 74,
    "wrong": 75,
    "continue": 76,
    "tuesday": 77,
    "now": 78,
    "monday": 79,
    "due": 80,
    "run": 81,
    "morning": 82,
    "fine": 83,
    "take": 84,
    "why": 85,
    "tomorrow": 86,
    "home": 87,
    "improve": 88,
    "class": 89,
    "together": 90,
    "study": 91,
    "please": 92,
    "look": 93,
    "history": 94,
    "school": 95,
    "do": 96,
    "yes": 97,
    "watch": 98,
    "wait": 99,
    "sorry": 100,
    "your": 101,
    "hand": 102,
    "raise": 103,
    "seat": 104,
    "long": 105,
    "should": 106,
    "note": 107,
    "city": 108,
    "live": 109,
    "speak": 110,
    "open": 111,
    "test": 112,
    "remember": 113,
    "four": 114,
    "student": 115,
    "science": 116,
    "interesting": 117,
    "put": 118,
    "meet": 119,
    "this": 120,
    "who": 121,
    "she": 122,
    "every": 123,
    "worry": 124,
    "no": 125,
    "friend": 126,
    "pleased": 127,
    "hello": 128,
    "everyone": 129,
    "each": 130,
    "other": 131,
    "help": 132,
    "that": 133,
    "repeat": 134,
    "sit": 135,
    "my": 136,
    "have": 137,
    "great": 138,
    "job": 139,
    "cost": 140,
    "word": 141,
    "ready": 142,
    "hard": 143,
    "daily": 144,
    "english": 145,
    "attention": 146,
    "pay": 147,
    "but": 148,
    "must": 149,
    "many": 150,
    "maybe": 151,
    "later": 152,
    "on": 153,
    "teacher": 154,
    "arrive": 155,
    "support": 156,
    "present": 157,
    "correct": 158,
    "explain": 159,
    "would": 160,
    "ask": 161,
    "busy": 162,
    "forget": 163,
    "mean": 164,
    "okay": 165,
    "find": 166,
    "share": 167,
    "been": 168,
    "start": 169,
    "appreciate": 170,
    "next": 171,
    "week": 172,
    "text": 173,
    "partner": 174,
    "close": 175,
    "math": 176,
    "well": 177,
    "grammar": 178,
    "rule": 179,
    "one": 180,
    "happy": 181,
    "group": 182,
    "classroom": 183,
    "excellent": 184,
    "back": 185,
    "stand": 186,
    "right": 187,
    "bathroom": 188,
    "of": 189,
    "course": 190,
    "lesson": 191,
    "video": 192,
    "guidance": 193,
    "sure": 194,
    "listen": 195,
    "me": 196,
    "show": 197,
    "could": 198,
    "excuse": 199,
    "care": 200,
    "quiet": 201,
    "month": 202,
    "subject": 203,
    "favorite": 204,
    "soon": 205,
    "concept": 206,
    "two": 207,
    "skill": 208,
    "very": 209,
    "us": 210,
    "give": 211,
    "hi": 212,
    "goodbye": 213,
    "bye": 214,
    "thank": 215,
    "welcome": 216,
    "alright": 217,
    "agree": 218
  },
  "idx2word": {
    "0": "<pad>",
    "1": "<unk>",
    "2": "<sos>",
    "3": "<eos>",
    "4": "they",
    "5": "sign",
    "6": "practice",
    "7": "we",
    "8": "sad",
    "9": "time",
    "10": "need",
    "11": "money",
    "12": "try",
    "13": "i",
    "14": "food",
    "15": "work",
    "16": "he",
    "17": "new",
    "18": "question",
    "19": "come",
    "20": "important",
    "21": "like",
    "22": "you",
    "23": "want",
    "24": "will",
    "25": "phone",
    "26": "write",
    "27": "not",
    "28": "learn",
    "29": "may",
    "30": "know",
    "31": "can",
    "32": "water",
    "33": "book",
    "34": "understand",
    "35": "it",
    "36": "nice",
    "37": "how",
    "38": "yesterday",
    "39": "name",
    "40": "teach",
    "41": "read",
    "42": "day",
    "43": "pen",
    "44": "night",
    "45": "more",
    "46": "bad",
    "47": "idea",
    "48": "easy",
    "49": "chair",
    "50": "when",
    "51": "evening",
    "52": "go",
    "53": "big",
    "54": "friday",
    "55": "afternoon",
    "56": "table",
    "57": "see",
    "58": "answer",
    "59": "sunday",
    "60": "thursday",
    "61": "computer",
    "62": "think",
    "63": "difficult",
    "64": "today",
    "65": "problem",
    "66": "good",
    "67": "what",
    "68": "old",
    "69": "office",
    "70": "eat",
    "71": "language",
    "72": "where",
    "73": "homework",
    "74": "finish",
    "75": "wrong",
    "76": "continue",
    "77": "tuesday",
    "78": "now",
    "79": "monday",
    "80": "due",
    "81": "run",
    "82": "morning",
    "83": "fine",
    "84": "take",
    "85": "why",
    "86": "tomorrow",
    "87": "home",
    "88": "improve",
    "89": "class",
    "90": "together",
    "91": "study",
    "92": "please",
    "93": "look",
    "94": "history",
    "95": "school",
    "96": "do",
    "97": "yes",
    "98": "watch",
    "99": "wait",
    "100": "sorry",
    "101": "your",
    "102": "hand",
    "103": "raise",
    "104": "seat",
    "105": "long",
    "106": "should",
    "107": "note",
    "108": "city",
    "109": "live",
    "110": "speak",
    "111": "open",
    "112": "test",
    "113": "remember",
    "114": "four",
    "115": "student",
    "116": "science",
    "117": "interesting",
    "118": "put",
    "119": "meet",
    "120": "this",
    "121": "who",
    "122": "she",
    "123": "every",
    "124": "worry",
    "125": "no",
    "126": "friend",
    "127": "pleased",
    "128": "hello",
    "129": "everyone",
    "130": "each",
    "131": "other",
    "132": "help",
    "133": "that",
    "134": "repeat",
    "135": "sit",
    "136": "my",
    "137": "have",
    "138": "great",
    "139": "job",
    "140": "cost",
    "141": "word",
    "142": "ready",
    "143": "hard",
    "144": "daily",
    "145": "english",
    "146": "attention",
    "147": "pay",
    "148": "but",
    "149": "must",
    "150": "many",
    "151": "maybe",
    "152": "later",
    "153": "on",
    "154": "teacher",
    "155": "arrive",
    "156": "support",
    "157": "present",
    "158": "correct",
    "159": "explain",
    "160": "would",
    "161": "ask",
    "162": "busy",
    "163": "forget",
    "164": "mean",
    "165": "okay",
    "166": "find",
    "167": "share",
    "168": "been",
    "169": "start",
    "170": "appreciate",
    "171": "next",
    "172": "week",
    "173": "text",
    "174": "partner",
    "175": "close",
    "176": "math",
    "177": "well",
    "178": "grammar",
    "179": "rule",
    "180": "one",
    "181": "happy",
    "182": "group",
    "183": "classroom",
    "184": "excellent",
    "185": "back",
    "186": "stand",
    "187": "right",
    "188": "bathroom",
    "189": "of",
    "190": "course",
    "191": "lesson",
    "192": "video",
    "193": "guidance",
    "194": "sure",
    "195": "listen",
    "196": "me",
    "197": "show",
    "198": "could",
    "199": "excuse",
    "200": "care",
    "201": "quiet",
    "202": "month",
    "203": "subject",
    "204": "favorite",
    "205": "soon",
    "206": "concept",
    "207": "two",
    "208": "skill",
    "209": "very",
    "210": "us",
    "211": "give",
    "212": "hi",
    "213": "goodbye",
    "214": "bye",
    "215": "thank",
    "216": "welcome",
    "217": "alright",
    "218": "agree"
  }
}